# ClearAllTemperatures Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FluidType..::..ClearAllTemperatures Method
FluidType Class See Also
---
Clears all fluid temperatures in the set.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void ClearAllTemperatures()
```

Visual Basic
---
```text
Public Sub ClearAllTemperatures
```

Visual C++
---
```text
public:
void ClearAllTemperatures()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if some temperatures in the FluidType object are in use. |

# See Also
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace